import pytest

@pytest.fixture
def date_string():
    return '31.12.2021 16:39:04'

@pytest.fixture
def data_list():
    return [
        {'Дата операции': '03.01.2018 14:55:21',
         'Дата платежа': '05.01.2018',
         'Номер карты': '*7197',
         'Статус': 'OK',
         'Сумма операции': '-21,00',
         'Валюта операции': 'RUB',
         'Сумма платежа': '-21,00',
         'Валюта платежа': 'RUB',
         'Кэшбэк': '',
         'Категория': 'Красота',
         'MCC': '5977',
         'Описание': 'OOO Balid',
         'Бонусы (включая кэшбэк)': '0,00',
         'Округление на инвесткопилку': '0,00',
         'Сумма операции с округлением': '21,00'}
    ]

@pytest.fixture
def category():
    return 'Супермаркеты'